zephyrproject-rtos/zephyr/boards/sensoan/sgw2/sgw2_nrf5340.h
/*
 * Copyright (c) 2024 Sensoan Oy
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef SGW2_NRF5340_H
#define SGW2_NRF5340_H

#include "board.h"

#define MCU_IF_PORT_0 0
#define MCU_IF_PIN_0  13
#define MCU_IF_PORT_1 0
#define MCU_IF_PIN_1  16
#define MCU_IF_PORT_2 0
#define MCU_IF_PIN_2  19
#define MCU_IF_PORT_3 0
#define MCU_IF_PIN_3  21
#define MCU_IF_PORT_4 1
#define MCU_IF_PIN_4  4
#define MCU_IF_PORT_5 1
#define MCU_IF_PIN_5  6
#define MCU_IF_PORT_6 1
#define MCU_IF_PIN_6  8

#define EDGE_CONN_PORT_24 0
#define EDGE_CONN_PIN_24  7
#define EDGE_CONN_PORT_25 0
#define EDGE_CONN_PIN_25  6
#define EDGE_CONN_PORT_26 0
#define EDGE_CONN_PIN_26  5
#define EDGE_CONN_PORT_29 0
#define EDGE_CONN_PIN_29  4
#define EDGE_CONN_PORT_31 1
#define EDGE_CONN_PIN_31  3
#define EDGE_CONN_PORT_33 1
#define EDGE_CONN_PIN_33  2
#define EDGE_CONN_PORT_49 0
#define EDGE_CONN_PIN_49  9
#define EDGE_CONN_PORT_50 0
#define EDGE_CONN_PIN_50  10
#define EDGE_CONN_PORT_51 0
#define EDGE_CONN_PIN_51  11
#define EDGE_CONN_PORT_52 0
#define EDGE_CONN_PIN_52  12

#endif /* SGW2_NRF5340_H */
